## MSBD5001 Foundations of Data Analytics

## Tutorial 6
### Pandas

Pandas is a library for structured data operations and manipulations
<url>https://pandas.pydata.org/docs/index.html</url>

To install Pandas in Jupyter Notebook using pip, run the following cell:

In [100]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kccec\anaconda3\envs\msbd_2021\lib\site-packages (1.3.2)
Requirement already satisfied: numpy>=1.17.3 in c:\users\kccec\anaconda3\envs\msbd_2021\lib\site-packages (from pandas) (1.21.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\kccec\anaconda3\envs\msbd_2021\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\kccec\anaconda3\envs\msbd_2021\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\kccec\anaconda3\envs\msbd_2021\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

Import the Pandas and NumPy packages

In [22]:
import numpy as np
import pandas as pd

#### Creating data frame

In [59]:
d = {'Name':['Mary', 'Tom', 'Ann'], 'Age':[22, 19, 30]}
df = pd.DataFrame(d)
print (df)
print (df.dtypes)

   Name  Age
0  Mary   22
1   Tom   19
2   Ann   30
Name    object
Age      int64
dtype: object

In [54]:
a = np.array([['Mary', 22], ['Tom', 19], ['Ann', 30]])
df2 = pd.DataFrame(a, columns=['Name','Age'])
print (df2)
print (df2.dtypes)

   Name Age
0  Mary  22
1   Tom  19
2   Ann  30
Name    object
Age     object
dtype: object

In [25]:
df3 = df2.astype({'Age':'int'})
df3.dtypes

Name    object
Age      int32
dtype: object

In [33]:
df3.index = ['A', 'B', 'C'] # Change the default index 
df3

   Name  Age
A  Mary   22
B   Tom   19
C   Ann   30

#### Access subset of data frame

In [26]:
df['Age']

0    22
1    19
2    30
Name: Age, dtype: int64

In [27]:
df[['Name', 'Age']]

   Name  Age
0  Mary   22
1   Tom   19
2   Ann   30

In [28]:
df['Age'] > 20 # Return a Boolean series

0     True
1    False
2     True
Name: Age, dtype: bool

In [ ]:
df[ df['Age'] > 20 ] # Return the rows which has 'Age' > 20

   Name  Age
0  Mary   22
2   Ann   30

In [ ]:
#  pandas.DataFrame.loc – Access a group of rows and columns by label(s) or a boolean array.

df.loc[0] # Return the row with index 0

Name    Mary
Age       22
Name: 0, dtype: object

In [31]:
df.loc[0, 'Name'] # Return the element at row index 0 and column label 'Name'

'Mary'

In [34]:
df.loc[ df['Age'] > 20, 'Name'] # Return the names with age > 20

0    Mary
2     Ann
Name: Name, dtype: object

In [42]:
df.loc[:2, 'Name'] # Return rows 0 to 2-1 (slicing) and column label 'Name'

0    Mary
1     Tom
2     Ann
Name: Name, dtype: object

In [ ]:
# pandas.DataFrame.iloc – Access a group of rows and columns by indexing (positions)
# note that the positions do not include the index (row labels) and header (column labels)

df.iloc[1] # Return rows with index 1

Name    Tom
Age      19
Name: 1, dtype: object

In [43]:
df.iloc[[1, 2]] # Return rows with index 1 & 2

  Name  Age
1  Tom   19
2  Ann   30

In [48]:
df.iloc[0, 1] # Return the element at row index 0 and column index 1

22

In [ ]:
df.iloc[0:2, 0:1] # Return the rows before index 2 and 
                  # columns before index 1
# note that the output does not include row 2 and column 1

   Name
0  Mary
1   Tom

In [ ]:
df.iloc[1, 1] = 20
df.loc[0, 'Age'] = 23 # Modify a value
df.loc[ df.shape[0] ] = ['Bob', 17] # Add a new row
# df.shape[0] gives the current number of rows
# alternatively, use df.loc[len(df)] = [...] or pd.concat to add a new row
df

   Name  Age
0  Mary   23
1   Tom   20
2   Ann   30
3   Bob   17

#### File I/O

In [91]:
titanic_df = pd.read_csv("titanic.csv") # Read a DataFrame from titanic.csv
titanic_df # Show the DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### Descriptive Statistics

In [92]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [93]:
titanic_df['Age'].max() # Return the max of the Age column

80.0

In [94]:
titanic_df[ ['Age','Fare'] ].min() # Return max of the Age and Fare columns

Age     0.42
Fare    0.00
dtype: float64

In [95]:
titanic_df['Age'].mean() # Return the mean of the Age column

29.69911764705882

In [96]:
titanic_df['Age'].median() # Return the median of the Age column

28.0

#### Handling Missing Values

In [97]:
titanic_df['Age'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [98]:
titanic_df['Age'].fillna( 0 )

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [99]:
titanic_df['Age'].dropna()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64